In [1]:

import pandas as pd
import numpy as np

In [2]:
data = [["yasir",20,'A'],
        ["yasir1",21,'A'],
        ["yasir2",24,'A'],
       ["yasir1",25,'A'],
       ["yasir1",22,'A']]

In [3]:
print(data)

[['yasir', 20, 'A'], ['yasir1', 21, 'A'], ['yasir2', 24, 'A'], ['yasir1', 25, 'A'], ['yasir1', 22, 'A']]

In [4]:
df = pd.DataFrame(data,columns=["name",'age','grade'],index = ['std1','std2','std3','std4','std5'])

In [5]:
df

        name  age grade
std1   yasir   20     A
std2  yasir1   21     A
std3  yasir2   24     A
std4  yasir1   25     A
std5  yasir1   22     A

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, std1 to std5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    5 non-null      object
 1   age     5 non-null      int64
 2   grade   5 non-null      object
dtypes: int64(1), object(2)
memory usage: 160.0+ bytes

In [7]:
df['year_birth'] = 2025 - df['age']

In [8]:
df['age']['std3'] = 26

C:\Users\memon\AppData\Local\Temp\ipykernel_13264\2125857607.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  df['age']['std3'] = 26
C:\Users\memon\AppData\Local\Temp\ipykernel_13264\2125857607.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['age']['std3'] = 26

In [9]:
df

        name  age grade  year_birth
std1   yasir   20     A        2005
std2  yasir1   21     A        2004
std3  yasir2   26     A        2001
std4  yasir1   25     A        2000
std5  yasir1   22     A        2003

In [10]:
calories = pd.read_csv('calories.csv')

In [11]:
calories.head(10)

   Duration  Pulse  Maxpulse  Calories
0      60.0    110       130     409.1
1      60.0    117       145     479.0
2      60.0    103       135     340.0
3      45.0    109       175     282.4
4      45.0    117       148     406.0
5      60.0    102       127     300.0
6      60.0    110       136     374.0
7       NaN    104       134     253.3
8      30.0    109       133     195.1
9      60.0     98       124     269.0

In [12]:
calories.tail()

     Duration  Pulse  Maxpulse  Calories
164      60.0    105       140     290.8
165      60.0    110       145     300.0
166      60.0    115       145     310.2
167      75.0    120       150     320.4
168      75.0    125       150     330.4

# Slicing

In [13]:
calories[5:10][['Maxpulse','Calories']]
calories.iloc[5:10,1:3]
calories.loc[5:10][['Maxpulse','Calories']]

    Maxpulse  Calories
5        127     300.0
6        136     374.0
7        134     253.3
8        133     195.1
9        124     269.0
10       147     329.3

# conditional slicing

In [14]:
data = [['Ahmed1','AIDS',80,'A'],
       ['Ahmed2','AIDS',85,'A'],
       ['Ahmed3','AIDS',75,'B'],
       ['Ahmed4','AIDS',72,'B'],
       ['Ahmed5','AIDS',60,'C']]
std_data = pd.DataFrame(data,columns = ['Name','Class','Marks','Grade'])

In [15]:
std_data

     Name Class  Marks Grade
0  Ahmed1  AIDS     80     A
1  Ahmed2  AIDS     85     A
2  Ahmed3  AIDS     75     B
3  Ahmed4  AIDS     72     B
4  Ahmed5  AIDS     60     C

In [16]:
std_data[std_data.Grade == 'A']

     Name Class  Marks Grade
0  Ahmed1  AIDS     80     A
1  Ahmed2  AIDS     85     A

In [17]:
std_data[std_data.Marks > 70][std_data.Grade == 'A']

C:\Users\memon\AppData\Local\Temp\ipykernel_13264\2803732428.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  std_data[std_data.Marks > 70][std_data.Grade == 'A']

     Name Class  Marks Grade
0  Ahmed1  AIDS     80     A
1  Ahmed2  AIDS     85     A

In [18]:
data = [{'Name':'Yasir', 'Age': 20, 'Marks':95, 'Grade':'A+'},
        {'Name':'Yasir', 'Age': 20, 'Marks':80, 'Grade':'A'},
        {'Name':'Yasir', 'Age': 20, 'Marks':75, 'Grade':'B+'},
        {'Name':'Yasir', 'Age': 20, 'Marks':75, 'Grade':'B+'},
        {'Name':'Yasir', 'Age': 20, 'Marks':65, 'Grade':'C+'},
        {'Name':'Yasir', 'Age': 20, 'Marks':95, 'Grade':'A+'},
        {'Name':'Yasir', 'Age': 20, 'Marks':65, 'Grade':'C+'},
       ]
std_data = pd.DataFrame(data)

In [19]:
std_data

    Name  Age  Marks Grade
0  Yasir   20     95    A+
1  Yasir   20     80     A
2  Yasir   20     75    B+
3  Yasir   20     75    B+
4  Yasir   20     65    C+
5  Yasir   20     95    A+
6  Yasir   20     65    C+

In [20]:
std_data.shape

(7, 4)

In [21]:
std_data.dtypes

Name     object
Age       int64
Marks     int64
Grade    object
dtype: object

In [22]:
calories.describe()

         Duration       Pulse    Maxpulse     Calories
count  168.000000  169.000000  169.000000   164.000000
mean    63.958333  107.461538  134.047337   375.790244
std     42.401185   14.510259   16.450434   266.379919
min     15.000000   80.000000  100.000000    50.300000
25%     45.000000  100.000000  124.000000   250.925000
50%     60.000000  105.000000  131.000000   318.600000
75%     60.000000  111.000000  141.000000   387.600000
max    300.000000  159.000000  184.000000  1860.400000

In [23]:
std_data.Grade.value_counts()

Grade
A+    2
B+    2
C+    2
A     1
Name: count, dtype: int64

In [24]:
calories.count()

Duration    168
Pulse       169
Maxpulse    169
Calories    164
dtype: int64

In [25]:
calories.isnull().sum()

Duration    1
Pulse       0
Maxpulse    0
Calories    5
dtype: int64

In [26]:
std_data.Marks.sum()

np.int64(550)

In [27]:
std_data['Total'] = 100

In [28]:
std_data

    Name  Age  Marks Grade  Total
0  Yasir   20     95    A+    100
1  Yasir   20     80     A    100
2  Yasir   20     75    B+    100
3  Yasir   20     75    B+    100
4  Yasir   20     65    C+    100
5  Yasir   20     95    A+    100
6  Yasir   20     65    C+    100

In [29]:
std_data['Per'] = (std_data.Marks / std_data.Total) * 100

In [30]:
std_data

    Name  Age  Marks Grade  Total   Per
0  Yasir   20     95    A+    100  95.0
1  Yasir   20     80     A    100  80.0
2  Yasir   20     75    B+    100  75.0
3  Yasir   20     75    B+    100  75.0
4  Yasir   20     65    C+    100  65.0
5  Yasir   20     95    A+    100  95.0
6  Yasir   20     65    C+    100  65.0

In [2]:
student = pd.read_csv('student_marks.csv')

In [3]:
student

           roll_no                  name  quiz_1  quiz_2  quiz_3  final_exam
0    SMIT/DSAI/001         Thomas Mcneil     6.0     1.0     6.0         6.0
1    SMIT/DSAI/002       Brian Davis Jr.     3.0     2.0     7.0         3.0
2    SMIT/DSAI/003  Christopher Thompson    10.0     8.0     2.0         7.0
3    SMIT/DSAI/004          Thomas Ortiz     7.0     6.0     5.0        19.0
4    SMIT/DSAI/005      Benjamin Aguirre     4.0     3.0     0.0        28.0
..             ...                   ...     ...     ...     ...         ...
495  SMIT/DSAI/496           Rita Torres     9.0     9.0     7.0         NaN
496  SMIT/DSAI/497           Paul Thomas     7.0     8.0     7.0         NaN
497  SMIT/DSAI/498           Jacob Simon     9.0     1.0    10.0        10.0
498  SMIT/DSAI/499        Kimberly Ayers     9.0     7.0     1.0         3.0
499  SMIT/DSAI/500           Alvin Brown     9.0     7.0     8.0         NaN

[500 rows x 6 columns]

In [4]:
student.dtypes

roll_no        object
name           object
quiz_1        float64
quiz_2        float64
quiz_3        float64
final_exam    float64
dtype: object

In [5]:
student['obtain'] = student.iloc[:, 2:].sum(axis = 1)

In [6]:
student

,roll_no,name,quiz_1,quiz_2,quiz_3,final_exam,obtain
0,SMIT/DSAI/001,Thomas Mcneil,6.0,1.0,6.0,6.0,19.0
1,SMIT/DSAI/002,Brian Davis Jr.,3.0,2.0,7.0,3.0,15.0
2,SMIT/DSAI/003,Christopher Thompson,10.0,8.0,2.0,7.0,27.0
3,SMIT/DSAI/004,Thomas Ortiz,7.0,6.0,5.0,19.0,37.0
4,SMIT/DSAI/005,Benjamin Aguirre,4.0,3.0,0.0,28.0,35.0
...,...,...,...,...,...,...,...
495,SMIT/DSAI/496,Rita Torres,9.0,9.0,7.0,NaN,25.0
496,SMIT/DSAI/497,Paul Thomas,7.0,8.0,7.0,NaN,22.0
497,SMIT/DSAI/498,Jacob Simon,9.0,1.0,10.0,10.0,30.0
498,SMIT/DSAI/499,Kimberly Ayers,9.0,7.0,1.0,3.0,20.0
499,SMIT/DSAI/500,Alvin Brown,9.0,7.0,8.0,NaN,24.0

In [7]:
student['total'] = 100

In [8]:
student['per'] = (student.obtain / student.total) * 100

In [9]:
student

,roll_no,name,quiz_1,quiz_2,quiz_3,final_exam,obtain,total,per
0,SMIT/DSAI/001,Thomas Mcneil,6.0,1.0,6.0,6.0,19.0,100,19.0
1,SMIT/DSAI/002,Brian Davis Jr.,3.0,2.0,7.0,3.0,15.0,100,15.0
2,SMIT/DSAI/003,Christopher Thompson,10.0,8.0,2.0,7.0,27.0,100,27.0
3,SMIT/DSAI/004,Thomas Ortiz,7.0,6.0,5.0,19.0,37.0,100,37.0
4,SMIT/DSAI/005,Benjamin Aguirre,4.0,3.0,0.0,28.0,35.0,100,35.0
...,...,...,...,...,...,...,...,...,...
495,SMIT/DSAI/496,Rita Torres,9.0,9.0,7.0,NaN,25.0,100,25.0
496,SMIT/DSAI/497,Paul Thomas,7.0,8.0,7.0,NaN,22.0,100,22.0
497,SMIT/DSAI/498,Jacob Simon,9.0,1.0,10.0,10.0,30.0,100,30.0
498,SMIT/DSAI/499,Kimberly Ayers,9.0,7.0,1.0,3.0,20.0,100,20.0
499,SMIT/DSAI/500,Alvin Brown,9.0,7.0,8.0,NaN,24.0,100,24.0

In [16]:
def grades_func(x):
    if x >= 80:
        return 'A'
    elif x >= 60:
        return 'B'
    elif x >= 40:
        return 'C'
    else:
        return 'F'

In [17]:
grades = student['per'].apply(grades_func)

In [18]:
student['grades'] = grades

In [40]:
grades = []
for p in student['per']:
    grades.append(grades_func(p))

In [41]:
student['grades'] = grades

In [19]:
student

,roll_no,name,quiz_1,quiz_2,quiz_3,final_exam,obtain,total,per,grades
0,SMIT/DSAI/001,Thomas Mcneil,6.0,1.0,6.0,6.0,19.0,100,19.0,F
1,SMIT/DSAI/002,Brian Davis Jr.,3.0,2.0,7.0,3.0,15.0,100,15.0,F
2,SMIT/DSAI/003,Christopher Thompson,10.0,8.0,2.0,7.0,27.0,100,27.0,F
3,SMIT/DSAI/004,Thomas Ortiz,7.0,6.0,5.0,19.0,37.0,100,37.0,F
4,SMIT/DSAI/005,Benjamin Aguirre,4.0,3.0,0.0,28.0,35.0,100,35.0,F
...,...,...,...,...,...,...,...,...,...,...
495,SMIT/DSAI/496,Rita Torres,9.0,9.0,7.0,NaN,25.0,100,25.0,F
496,SMIT/DSAI/497,Paul Thomas,7.0,8.0,7.0,NaN,22.0,100,22.0,F
497,SMIT/DSAI/498,Jacob Simon,9.0,1.0,10.0,10.0,30.0,100,30.0,F
498,SMIT/DSAI/499,Kimberly Ayers,9.0,7.0,1.0,3.0,20.0,100,20.0,F
499,SMIT/DSAI/500,Alvin Brown,9.0,7.0,8.0,NaN,24.0,100,24.0,F

In [20]:
student.to_csv('new_student_data.csv')

In [43]:
import pandas as pd

In [44]:
student_data = pd.read_csv('students_five_classes.csv', na_values=['AB'])

In [45]:
student_data

           roll_no           name  exam1  exam2  final_exam
0    SMIT/DSAI/001    David Iqbal   20.0   16.0        35.0
1    SMIT/DSAI/002    Ahmed Ahmed   13.0    7.0         NaN
2    SMIT/DSAI/003     John Zahid   13.0   24.0        47.0
3    SMIT/DSAI/004    David Brown    0.0   15.0        24.0
4    SMIT/DSAI/005    Fatima Khan   20.0    8.0         6.0
..             ...            ...    ...    ...         ...
495   SMIT/MAW/096     Sara Zahid    8.0   10.0        45.0
496   SMIT/MAW/097     Ayesha Ali   14.0    3.0        31.0
497   SMIT/MAW/098  Michael Brown    2.0   20.0        50.0
498   SMIT/MAW/099     Sara Malik   24.0    6.0        16.0
499   SMIT/MAW/100       Noor Ali    9.0   11.0        44.0

[500 rows x 5 columns]

# How to drop and fill NaN values

In [46]:
# student_data.dropna(inplace = True)
student_data.fillna(0, inplace = True)

In [47]:
student_data

           roll_no           name  exam1  exam2  final_exam
0    SMIT/DSAI/001    David Iqbal   20.0   16.0        35.0
1    SMIT/DSAI/002    Ahmed Ahmed   13.0    7.0         0.0
2    SMIT/DSAI/003     John Zahid   13.0   24.0        47.0
3    SMIT/DSAI/004    David Brown    0.0   15.0        24.0
4    SMIT/DSAI/005    Fatima Khan   20.0    8.0         6.0
..             ...            ...    ...    ...         ...
495   SMIT/MAW/096     Sara Zahid    8.0   10.0        45.0
496   SMIT/MAW/097     Ayesha Ali   14.0    3.0        31.0
497   SMIT/MAW/098  Michael Brown    2.0   20.0        50.0
498   SMIT/MAW/099     Sara Malik   24.0    6.0        16.0
499   SMIT/MAW/100       Noor Ali    9.0   11.0        44.0

[500 rows x 5 columns]

In [48]:
student_data.dtypes

roll_no        object
name           object
exam1         float64
exam2         float64
final_exam    float64
dtype: object

In [49]:
student_data = student_data.astype({'exam1':int,
                    'exam2': float,
                    'final_exam': int})

In [50]:
student_data.dtypes

roll_no        object
name           object
exam1           int64
exam2         float64
final_exam      int64
dtype: object

In [51]:
student_data['obtain_marks'] = student_data.iloc[:, 2:].sum(axis = 1)

In [52]:
student_data['total_marks'] = 100

In [53]:
student_data['percenage'] = (student_data['obtain_marks']/student_data['total_marks'])*100

In [54]:
student_data

,roll_no,name,exam1,exam2,final_exam,obtain_marks,total_marks,percenage
0,SMIT/DSAI/001,David Iqbal,20,16.0,35,71.0,100,71.0
1,SMIT/DSAI/002,Ahmed Ahmed,13,7.0,0,20.0,100,20.0
2,SMIT/DSAI/003,John Zahid,13,24.0,47,84.0,100,84.0
3,SMIT/DSAI/004,David Brown,0,15.0,24,39.0,100,39.0
4,SMIT/DSAI/005,Fatima Khan,20,8.0,6,34.0,100,34.0
...,...,...,...,...,...,...,...,...
495,SMIT/MAW/096,Sara Zahid,8,10.0,45,63.0,100,63.0
496,SMIT/MAW/097,Ayesha Ali,14,3.0,31,48.0,100,48.0
497,SMIT/MAW/098,Michael Brown,2,20.0,50,72.0,100,72.0
498,SMIT/MAW/099,Sara Malik,24,6.0,16,46.0,100,46.0
499,SMIT/MAW/100,Noor Ali,9,11.0,44,64.0,100,64.0

In [55]:
def grades_func(x):
    if x >= 80:
        return 'A'
    elif x >= 70:
        return 'B'
    elif x >= 60:
        return 'C'
    else:
        return 'F'

In [56]:
student_data['grades'] = student_data['percenage'].apply(grades_func)

In [57]:
student_data['classes'] = student_data['roll_no'].str.split('/').str[1]

In [58]:
student_data.classes.unique()

array(['DSAI', 'DM', 'UIUX', 'GD', 'MAW'], dtype=object)

In [59]:
students_DSAI = student_data[student_data['classes'] == 'DSAI']
students_DM = student_data[student_data['classes'] == 'DM']
students_UIUX = student_data[student_data['classes'] == 'UIUX']
students_GD = student_data[student_data['classes'] == 'GD']
students_MAW = student_data[student_data['classes'] == 'MAW']

In [60]:
students_DM.loc[students_DM['percenage'].idxmax()]

roll_no         SMIT/DM/009
name             Sara Iqbal
exam1                    19
exam2                  17.0
final_exam               49
obtain_marks           85.0
total_marks             100
percenage              85.0
grades                    A
classes                  DM
Name: 108, dtype: object

In [61]:
students_DM.loc[students_DM['percenage'].idxmin()]

roll_no         SMIT/DM/055
name             Hina Brown
exam1                     3
exam2                   6.0
final_exam                1
obtain_marks           10.0
total_marks             100
percenage              10.0
grades                    F
classes                  DM
Name: 154, dtype: object

In [62]:
print(students_DM['percenage'].mean())

51.86

In [67]:
new_df = students_DM.drop(['roll_no','name','classes','grades'], axis = 1)

In [68]:
new_df.mean()

exam1            13.08
exam2            13.95
final_exam       24.83
obtain_marks     51.86
total_marks     100.00
percenage        51.86
dtype: float64

In [69]:
new_df.median()

exam1            13.0
exam2            15.5
final_exam       27.5
obtain_marks     53.0
total_marks     100.0
percenage        53.0
dtype: float64

In [98]:
data = [["yasir",20,'A'],
        ["yasir1",21,'A'],
        ["yasir2",24,'A'],
       ["yasir1",25,'A'],
       ["yasir1",np.nan,'A'],
        ["yasir1",22,'A'],
        ["yasir1",22,'A'],
        ["yasir1",22,'A'],
       
       ]
my_df = pd.DataFrame(data)

In [99]:
my_df

        0     1  2
0   yasir  20.0  A
1  yasir1  21.0  A
2  yasir2  24.0  A
3  yasir1  25.0  A
4  yasir1   NaN  A
5  yasir1  22.0  A
6  yasir1  22.0  A
7  yasir1  22.0  A

In [93]:
print(my_df[1].mean())
print(my_df[1].median())

22.25
22.0

In [94]:
my_df.mode()

        0   1  2
0  yasir1  22  A

In [101]:
my_df[1].fillna(my_df[1].mean())

0    20.000000
1    21.000000
2    24.000000
3    25.000000
4    22.285714
5    22.000000
6    22.000000
7    22.000000
Name: 1, dtype: float64

Groupeby

In [102]:
student_data

,roll_no,name,exam1,exam2,final_exam,obtain_marks,total_marks,percenage,grades,classes
0,SMIT/DSAI/001,David Iqbal,20,16.0,35,71.0,100,71.0,B,DSAI
1,SMIT/DSAI/002,Ahmed Ahmed,13,7.0,0,20.0,100,20.0,F,DSAI
2,SMIT/DSAI/003,John Zahid,13,24.0,47,84.0,100,84.0,A,DSAI
3,SMIT/DSAI/004,David Brown,0,15.0,24,39.0,100,39.0,F,DSAI
4,SMIT/DSAI/005,Fatima Khan,20,8.0,6,34.0,100,34.0,F,DSAI
...,...,...,...,...,...,...,...,...,...,...
495,SMIT/MAW/096,Sara Zahid,8,10.0,45,63.0,100,63.0,C,MAW
496,SMIT/MAW/097,Ayesha Ali,14,3.0,31,48.0,100,48.0,F,MAW
497,SMIT/MAW/098,Michael Brown,2,20.0,50,72.0,100,72.0,B,MAW
498,SMIT/MAW/099,Sara Malik,24,6.0,16,46.0,100,46.0,F,MAW
499,SMIT/MAW/100,Noor Ali,9,11.0,44,64.0,100,64.0,C,MAW

In [104]:
class_group = student_data.groupby('classes')

In [108]:
class_group.get_group('DM')[student_data['name']=='Noor Hussain']

C:\Users\memon\AppData\Local\Temp\ipykernel_13264\1516765724.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  class_group.get_group('DM')[student_data['name']=='Noor Hussain']

,roll_no,name,exam1,exam2,final_exam,obtain_marks,total_marks,percenage,grades,classes
100,SMIT/DM/001,Noor Hussain,15,8.0,34,57.0,100,57.0,F,DM

# DF concate

In [18]:
data = [["yasir",20,],
        ["yasir1",21,],
        ["yasir2",24,],
       ["yasir1",25,],
       ["yasir1",22,]]

In [19]:
data1 = [["Ahmed",20,'A'],
        ["Ahmed1",21,'A'],
        ["Ahmed2",24,'A'],
       ["Ahmed1",25,'A'],
       ["Ahmed1",22,'A']]

In [20]:
my_df1 = pd.DataFrame(data)

In [21]:
my_df2 = pd.DataFrame(data1)

In [22]:
my_df1

        0   1
0   yasir  20
1  yasir1  21
2  yasir2  24
3  yasir1  25
4  yasir1  22

In [23]:
my_df2

        0   1  2
0   Ahmed  20  A
1  Ahmed1  21  A
2  Ahmed2  24  A
3  Ahmed1  25  A
4  Ahmed1  22  A

In [26]:
pd.concat([my_df2,my_df1], ignore_index=True, axis=0, join='inner')

        0   1
0   Ahmed  20
1  Ahmed1  21
2  Ahmed2  24
3  Ahmed1  25
4  Ahmed1  22
5   yasir  20
6  yasir1  21
7  yasir2  24
8  yasir1  25
9  yasir1  22

In [27]:
orders = pd.read_csv('orders.csv')

In [29]:
customer = pd.read_csv('customers.csv')

In [30]:
orders.head()

  order_id customer_id product_id  quantity  order_date
0   O00001       C0333       P022         1  2022-01-09
1   O00002       C0068       P090         1  2022-01-27
2   O00003       C0483       P021         1  2022-01-17
3   O00004       C0214       P076         4  2022-01-07
4   O00005       C0411       P073         4  2022-01-12

In [31]:
customer.head()

  customer_id      name  age gender               city
0       C0001  Jennifer   56   Male      Morrisonmouth
1       C0002   William   46   Male  Port Charlesshire
2       C0003     Ellen   32   Male  South Thomasmouth
3       C0004     Sheri   60   Male         West Megan
4       C0005    Taylor   25   Male         Josephland

In [40]:
orders.merge(customer[['customer_id','name']], on='customer_id')

     order_id customer_id product_id  quantity  order_date         name
0      O00001       C0333       P022         1  2022-01-09  Christopher
1      O00002       C0068       P090         1  2022-01-27        Kathy
2      O00003       C0483       P021         1  2022-01-17         Cody
3      O00004       C0214       P076         4  2022-01-07     Jennifer
4      O00005       C0411       P073         4  2022-01-12         Kent
...       ...         ...        ...       ...         ...          ...
2579   O02580       C0237       P098         5  2024-12-22       Tamara
2580   O02581       C0236       P007         1  2024-12-05         Dana
2581   O02582       C0029       P035         1  2024-12-12       Denise
2582   O02583       C0171       P077         1  2024-12-16       Ashley
2583   O02584       C0421       P038         5  2024-12-01      Michael

[2584 rows x 6 columns]

In [41]:
products = pd.read_csv('products.csv')

In [42]:
products

   product_id product_name     category   price
0        P001        Stage     Clothing  534.93
1        P002        Least  Accessories   56.56
2        P003       Number         Home  339.92
3        P004      Evening     Clothing  138.74
4        P005      Protect     Footwear   68.06
..        ...          ...          ...     ...
95       P096      Service     Footwear  872.76
96       P097         Away         Home  932.46
97       P098     Decision  Accessories  567.31
98       P099           So  Electronics  698.17
99       P100   Everything         Home  922.89

[100 rows x 4 columns]

In [45]:
complete_orders = orders.merge(products[['product_id','price']], on='product_id')

In [47]:
complete_orders

     order_id customer_id product_id  quantity  order_date   price
0      O00001       C0333       P022         1  2022-01-09  185.33
1      O00002       C0068       P090         1  2022-01-27  947.55
2      O00003       C0483       P021         1  2022-01-17  938.65
3      O00004       C0214       P076         4  2022-01-07  154.17
4      O00005       C0411       P073         4  2022-01-12  131.85
...       ...         ...        ...       ...         ...     ...
2579   O02580       C0237       P098         5  2024-12-22  567.31
2580   O02581       C0236       P007         1  2024-12-05  325.74
2581   O02582       C0029       P035         1  2024-12-12  362.04
2582   O02583       C0171       P077         1  2024-12-16  233.11
2583   O02584       C0421       P038         5  2024-12-01  817.52

[2584 rows x 6 columns]

In [48]:
complete_orders['Total'] = complete_orders.price * complete_orders.quantity

In [49]:
complete_orders

     order_id customer_id product_id  quantity  order_date   price    Total
0      O00001       C0333       P022         1  2022-01-09  185.33   185.33
1      O00002       C0068       P090         1  2022-01-27  947.55   947.55
2      O00003       C0483       P021         1  2022-01-17  938.65   938.65
3      O00004       C0214       P076         4  2022-01-07  154.17   616.68
4      O00005       C0411       P073         4  2022-01-12  131.85   527.40
...       ...         ...        ...       ...         ...     ...      ...
2579   O02580       C0237       P098         5  2024-12-22  567.31  2836.55
2580   O02581       C0236       P007         1  2024-12-05  325.74   325.74
2581   O02582       C0029       P035         1  2024-12-12  362.04   362.04
2582   O02583       C0171       P077         1  2024-12-16  233.11   233.11
2583   O02584       C0421       P038         5  2024-12-01  817.52  4087.60

[2584 rows x 7 columns]

In [51]:
complete_orders['order_date'] = pd.to_datetime(complete_orders.order_date)

In [54]:
complete_orders['year'] = complete_orders.order_date.dt.year

In [56]:
group = complete_orders.groupby('year')

In [59]:
group.get_group(2022).Total.sum()

np.float64(1357500.38)

In [63]:
complete_orders.to_csv('Datasets/complete_orders.csv')

In [64]:
complete_orders.to_json('complete_orders.json')

In [ ]:
pd.rea